Revit 2027 API
BuiltInFailures.StairRampFailures.BadRailingsError Property
 Can't create Railings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadRailingsError { get; }
Public Shared ReadOnly Property BadRailingsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadRailingsError {
	FailureDefinitionId^ get ();
}
static member BadRailingsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace